CREATE TABLE test_table(
    name varchar(10) CHECK(length(name) BETWEEN 4 AND 10),
    surname varchar(50),
    city varchar(50),
    age smallint CHECK(age BETWEEN 1 AND 150)
);
insert into test_table(name, surname, city, age)
values 
('Иван','Иванов','Москва', 18), -- 1
('Николай','Иванов','Москва', 22),
('Мария','Петрова','Москва', 33),
('Софья','Петрова','Москва', 7),
('Владимир','Иванов','Москва', 66), -- 5
('Иван','Иванов','Москва', 43),
('Мария','Петрова','Москва', 12),
('Олег','Иванов','Москва', 99),
('Олег','Иванов','Москва', 7),
('Вячеслав','Иванов','Москва', 22),-- 10
('Иван','Иванов','Москва', 14),
('Софья','Петрова','Москва', 54),
('Владимир','Иванов','Москва', 32),
('Николай','Иванов','Москва', 65),
('Мария','Петрова','Москва', 65), -- 15
('Иван','Иванов','Москва', 34),
('Олег','Иванов','Москва', 54),
('Софья','Петрова','Москва', 87),
('Иван','Иванов','Москва', 43),
('Вячеслав','Иванов','Москва', 21); -- 20